import { ReviewCardProps } from '@/components/ReviewCard/ReviewCard.type';

export const reviewContents: ReviewCardProps[] = [
  {
    name: '김*주',
    content:
      '팀의 등대와 같은 역할입니다. 맡은 바를 일정보다 빠르게 진행하려고 노력하며 코드 퀄리티와 디테일이 매우 상세합니다. 문서화와 PR리뷰도 굉장히 상세하여 팀의 개발에 큰 도움이되었습니다. 만약 팀을 구성한다면 꼭 팀원으로 데려가고 싶은 구성원입니다.',
    belong: '프로그래머스',
    position: 'mentee',
  },
  {
    name: '류*규',
    content:
      '경빈님은 초반부터 주도적으로 학습하시려는 태도가 좋았습니다. 초반 티 타임 때 리액트쿼리 공식문서도 능동적으로 학습하시는 것이 기억에 남습니다. 또한 기술적역량이나 자기주도적 학습에 있어서 현재 잘하고 계시다는 말씀을 드리고 싶습니다. 맡은 일감을 처리할 때 마감 기한보다 일찍개발을 마치시는 걸로 보았을 때 시간을 효율적으로 잘 활용하시고 계신 것 같습니다.',
    belong: '프로그래머스',
    position: 'mentor',
  },
  {
    name: '박*연',
    content:
      '경빈님은 맡은 임무를 잘 수행하였습니다. 팀장을 맡아 묵묵히 필요한 것들을 불평 불만 없이 해주었습니다. 귀찮다고 느껴질 수 있는 일들 예를들어 발표자료 관련스크립트, 발표자료 정리 등을 조용히 해결해주셔서 항상 감사했습니다. 또한, 프로젝트 진행 중 맡은 부분을 제시간안에 완성도 있게 잘 끝내주었습니다.',
    belong: '프로그래머스',
    position: 'mentee',
  },
  {
    name: '백*원',
    content:
      '해결하지 못한 부분에 대해서 코어타임 이외에 많이 찾아보고 최대한 문제를 해결하기위해 많이 노력합니다. 모르는부분이나 에러가 발생하는 부분에 의견을 많이 나누고 함께 작업하기에 좋은 팀원입니다',
    belong: '프로그래머스',
    position: 'mentee',
  },
  {
    name: '윤*민',
    content:
      '어려운 부분은 스스로 찾아보고, 팀원들과도 문제를 공유하며 해결하려는 모습이 우수합니다. 또, 스스로 할일을 찾아 진행하는 자기주도 학습태도가 우수합니다.',
    belong: '프로그래머스',
    position: 'mentee',
  },
  {
    name: '안*현',
    content:
      '자신이 부족한 부분이 있다면 해당 지식을 채우기 위해 노력하는 모습이 갖춰있고 그런점을 배우고 싶었던 팀원입니다. 또한, 미처 발견하지 못했던 오류들을 먼저 찾아주고 공유 해주었습니다.',
    belong: '프로그래머스',
    position: 'mentee',
  },
  {
    name: '김*현',
    content:
      '코어타임에 항상 제시간에 참여하시는 바로 미루어 보아 성실한 학습태도를 지니고 계십니다.',
    belong: '프로그래머스',
    position: 'mentee',
  },
  {
    name: '더기',
    content:
      '전반적으로 협업 및 과제 수행 능력에 있어서 부족함이 없다고 생각합니다.',
    belong: '프로그래머스',
    position: 'mentor',
  },
  {
    name: '최*오',
    content:
      '기술역량에 대해 본인이 부족한 점이 어떤것인지 인지하고 있으며 극복하기 위해 노력하는 것이 과제를 통해서 느껴졌습니다.',
    belong: '프로그래머스',
    position: 'mentee',
  },
  {
    name: '김*훈',
    content:
      '업무 처리나 커뮤니케이션에서 모두 군더더기 없이 깔끔하다고 느껴집니다. 팀원으로써 커뮤니케이션하기 편안했습니다.',
    belong: '프로그래머스',
    position: 'mentee',
  },
  {
    name: '하*희',
    content:
      '맡은 역할을 끝까지 책임지고 완수하는 팀원입니다. 문제가 생겼을 때 팀원들에게 공유하고 해결하려는 태도가 좋았습니다.',
    belong: '프로그래머스',
    position: 'mentee',
  },

  {
    name: '김*주',
    content:
      '항상 본인이 맡은 태스크를 기간 내에 정말 빠르게 작업해주었습니다.',
    belong: '프로그래머스',
    position: 'mentee',
  },
  {
    name: '이*나',
    content: '퀄리티 있는 결과물을 위해 고민하고 소통하는 모습이 좋았습니다.',
    belong: '프로그래머스',
    position: 'mentee',
  },
  {
    name: '오*주',
    content:
      '항상 열심히 해주시고 웃음이 많으셔서 팀내 분위기를 좋게 만들어주셨습니다.',
    belong: '프로그래머스',
    position: 'mentee',
  },
];
